app/views/topics/index.html.erb

SELECT COUNT(*) FROM "responses" WHERE "responses"."topic_id" = ?  [["topic_id", 15]]
---
            <td><strong><%= link_to topic.title, topic_path(topic.id) %></strong></td>
            <td><%= topic.responses.count %></td>

SELECT "categories".* FROM "categories"
---
    </table>
     <% @topic.categories.each do |category| %>

SELECT "categories".* FROM "categories"
---
          <h3><%= f.label :カテゴリ, class:"fas fa-clipboard-list"%></h3>
          <%= f.collection_check_boxes(:category_ids, Category.all, :id, :name) do |category| %>