app/views/topics/show.html.erb

  <p class="text-center">[カテゴリ]
    <% @topic.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "topic_categories" ON "categories"."id" = "topic_categories"."category_id" WHERE "topic_categories"."topic_id" = ?  [["topic_id", 14]]