app/views/users/_profile.html.erb

        <td><strong><%= link_to topic.title, topic_path(topic.id) %><strong></td>
        <td><%= topic.topic_comments.count %></td>
---
SELECT COUNT(*) FROM "topics" WHERE "topics"."user_id" = ?  [["user_id", 2]]
SELECT "topics".* FROM "topics" WHERE "topics"."user_id" = ? ORDER BY "topics"."created_at" DESC  [["user_id", 2]]