app/views/users/_profile.html.erb

SELECT COUNT(*) FROM "responses" WHERE "responses"."topic_id" = ?  [["topic_id", 1]]
---
        <td><strong><%= link_to topic.title, topic_path(topic.id) %><strong></td>
        <td><%= topic.responses.count %></td>