app/controllers/categories_controller.rb

  def index
    @category = Category.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"