app/controllers/responses_controller.rb

  def create
    @topic = Topic.find(params[:topic_id])
    @response = Response.new(response_params)
    @response.user_id = current_user.id
    @response.topic_id = params[:topic_id]
    if @response.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "responses" ("name", "body", "user_id", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "aa"], ["body", "aa"], ["user_id", 2], ["topic_id", 4], ["created_at", "2020-06-18 22:50:55.209485"], ["updated_at", "2020-06-18 22:50:55.209485"]]