app/controllers/topics_controller.rb

SELECT COUNT(DISTINCT "topics"."id") FROM "topics"
---
  def index
    @topic = Topic.new
    @q = Topic.ransack(params[:q])
    @topics = @q.result(distinct: true).page(params[:page]).per(5).order(created_at: :desc)

INSERT INTO "topics" ("user_id", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["title", "好きな戦国武将を語ろう"], ["created_at", "2020-06-19 02:15:03.623954"], ["updated_at", "2020-06-19 02:15:03.623954"]]
---
  def create
    @topic = Topic.new(topic_params)
    @topic.user_id = current_user.id
    if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "topics" SET "title" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["title", "「麒麟が来る」について語ろう。"], ["updated_at", "2020-06-19 07:01:55.573899"], ["id", 11]]
---
  def update
    @topic = Topic.find(params[:id])
    if @topic.update(topic_params)

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]
---
  def destroy
    topic = Topic.find(params[:id])
    topic.destroy

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def correct_user
    topic = Topic.find(params[:id])