app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @topics = Topic.all.where(user_id: current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "topics".* FROM "topics" WHERE "topics"."user_id" = ? ORDER BY "topics"."created_at" DESC  [["user_id", 2]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "introduce" = ?, "image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduce", "よろしくお願いします."], ["image_id", "ef9a25e655c65fdb57b9a7d0d422ecdb533eab3eb09ca0ee4af14b80a01b"], ["updated_at", "2020-06-18 16:37:22.062890"], ["id", 2]]